
<?php

// 2 ЗАДАНИЕ

// 	$name = "GeekBrains user";
// 	echo "Hello, $name!";

// 	$int10 = 42;
// 	$int2 = 0b101010;
// 	$int8 = 052;
// 	$int16 = 0x2A;
// 	echo "Десятеричная система $int10 <br>";
// 	echo "Двоичная система $int2 <br>";
// 	echo "Восьмеричная система $int8 <br>";
// 	echo "Шестнадцатеричная система $int16 <br>";


// 	//конкатенация 

// 	$k = 'Hello,';
// 	$m = 'world';
// 	$c = $k . $m;
// 	echo $c . '<br>';

// 	$a = 4;
// 	$b = 5;
	
// 	echo $a + $b . '<br>';    // сложение
// 	echo $a * $b . '<br>';    // умножение
// 	echo $b - $a . '<br>';    // вычитание
// 	echo $a / $b . '<br>';  // деление
// 	echo $a % $b . '<br>'; // остаток от деления
// 	echo $a ** $b . '<br>'; // возведение в степень

// 	// опрерации сравнения

// 	$a = 4;
// 	$b = 5;
// 	var_dump($a == $b);  // Сравнение по значению
// 	var_dump($a === $b); // Сравнение по значению и типу
// 	var_dump($a > $b);    // Больше
// 	var_dump($a < $b);    // Меньше
// 	var_dump($a <> $b);  // Не равно
// 	var_dump($a != $b);   // Не равно
// 	var_dump($a !== $b); // Не равно без приведения типов
// 	var_dump($a <= $b);  // Меньше или равно
// 	var_dump($a >= $b);  // Больше или равно

// echo  '<br>';

// 	$a = 4;
// 	$b = 5;
// 	$a += $b;
// 	echo 'a = ' . $a . '<br>';
// 	$a = 0;
// 	echo $a++ . '<br>';     // Постинкремент
// 	echo ++$a . '<br>';     // Преинкремент
// 	echo $a­­-- . '<br>';     // Постдекремент
// 	// echo ­--$a . '<br>';     // Предекремент



// 3 ЗАДАНИЕ

	$a = 5;
    $b = '05';
    var_dump($a == $b);         // == сравнивает только число , а не тип данных
    var_dump((int)'012345');     // int - приведение к числу , 0 в начале убирается
    var_dump((float)123.0 === (int)123.0); // === строгое сравнение по типу данных и значению
    var_dump((int)0 === (int)'hello, world'); // не знаю

// 4 ЗАДАНИЕ

    echo "<h1>Welcome to the first lesson!</h1>";
    echo '<h2>'.date('d.m.Y').'</h2>';

// 5 ЗАДАНИЕ 

    $a = 1;
    $b = 2;
    $b = $a;
    $a += $b;
    echo 'a = ' .$a . '<br>';
    echo 'b = ' .$b . '<br>';



?>
